Revit 2026 API
FamilyManager.NewType Method
Add a new family type with a given name and makes it be the current type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public FamilyType NewType(
	string typeName
)
Public Function NewType (
	typeName As String
) As FamilyType
public:
FamilyType^ NewType(
	String^ typeName
)
member NewType :
        typeName : string -> FamilyType
Parameters
typeName String
The name of new family type.
Return Value
FamilyType
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when the input argument-"typeName"-is null.
ArgumentException |  Thrown when the input argument-"typeName"-is already in use.
InvalidOperationException |  Thrown when the family type creation failed.
See Also
Reference
FamilyManager Class
Autodesk.Revit.DB Namespace